app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "activated_at", "crypted_password", "remember_token_expires_at", "activation_code", "remember_token", "login", "email", "created_at") VALUES('', 'a40e6f6dc3d8e0566a15f326fdaf23fadc085b65', '2009-09-29 08:52:23', NULL, '45595d6065d3bc818fc7f55cc38a87a1d8862063', NULL, '7026a001879bd619ee67b12d2dc1ccfcb8649217', NULL, 'wear', 'wear63659220@gmail.com', '2009-09-29 08:52:23')

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = '7026a001879bd619ee67b12d2dc1ccfcb8649217') LIMIT 1